app/controllers/priorities_controller.rb

SELECT "timelines".* FROM "timelines" WHERE ("timelines"."predecessor_id" IS NULL)
---
  def index
    @owner = params[:owner]
    @view_by = params[:view_by]
    @a = Date.parse "2011-01-01"
    @b = Date.parse "2011-03-01"
    @top_level_timelines = Timeline.find_all_by_predecessor_id(nil)